Tekla Open API Reference for Tekla Structures 2025
ControlCircle.Color Property
 Gets or sets the color of the control circle.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlCircle.ControlCircleColorEnum Color { get; set; }
Public Property Color As ControlCircle.ControlCircleColorEnum
	Get
	Set
Property Value
Type: ControlCircle.ControlCircleColorEnum
See Also
Reference
ControlCircle Class
Tekla.Structures.Model Namespace